Tekla Open API Reference for Tekla Structures 2025
Seam.Status Property
 The read only status of the seam. The status can be reported and shown in drawings. The color of the connection symbol in the model indicates the status of the seam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectionStatusEnum Status { get; }
Public ReadOnly Property Status As ConnectionStatusEnum
	Get
Property Value
Type: ConnectionStatusEnum
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace